blog/39.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 5.2.1 -- 5.2.3 A Register-Machine Simulator
#+subtitle: 2025-02-21 Fri
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.93 (<a href="https://orgmode.org">Org</a> mode 9.7.11)

* 
Authors present a scheme program which simulates the kind of register
machines described in 5.1.

The highest-level abstraction is the ~make-machine~ procedure, which
can be used to create a machine. It takes the names of the registers,
the list of the operations the machine uses, and the controller text.

~Set-register-contents!~ can be used to set the value of a register
and ~get-register-contents~ to retrieve it. ~Start~ is used to make
the machine start executing the instructions represented by the
controller text.

Authors superbly describe the implementation.

** Exercise 5.8
*Exercise*:

#+begin_quote
The following register-machine code is ambiguous, because the label
~here~ is defined more than once:

#+begin_src scheme
  start
  (goto (label here))
  here
  (assign a (const 3))
  (goto (label there))
  here
  (assign a (const 4))
  (goto (label there))
  there
#+end_src

With the simulator as written, what will the contents of register ~a~
be when control reaches ~there~?  Modify the ~extract-labels~
procedure so that the assembler will signal an error if the same label
name is used to indicate two different locations.
#+end_quote

*Answer*:

#+begin_quote
With the simulator as written, what will the contents of register ~a~
be when control reaches ~there~?
#+end_quote
Labels are stored in a list in the same order they are given by the
controller text. Given the implementation of ~lookup-label~ --- which
uses ~assoc~ ---, when the same labels appears more than once, the
first one in the list will be selected. So the answer is ~3~.

#+begin_quote
Modify the ~extract-labels~ procedure so that the assembler will
signal an error if the same label name is used to indicate two
different locations.
#+end_quote

Here is a modified version of the ~extract-labels~ method shown in
footnote 4, page 521 (as opposed to the one in the main text).

#+begin_src scheme
  (define (extract-labels text)
    (if (null? text)
        (cons '() '())
        (let ((result (extract-labels (cdr text))))
          (let ((insts (car result)) (labels (cdr result)))
            (let ((next-inst (car text)))
              (if (symbol? next-inst)
                  (if (assoc next-inst labels)
                      (error "Duplicated label:" next-inst)
                      (cons insts
                            (cons (make-label-entry next-inst insts) labels)))
                  (cons (cons (make-instruction next-inst) insts)
                        labels)))))))
#+end_src

** Exercise 5.9
*Exercise*:

#+begin_quote
The treatment of machine operations above permits them to operate on
labels as well as on constants and the contents of registers.  Modify
the expression-processing procedures to enforce the condition that
operations can be used only with registers and constants.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (make-operation-exp exp machine labels operations)
    (let ((op (lookup-prim (operation-exp-op exp) operations))
          (aprocs
           (map (lambda (e)
                  (if (label-exp? e)
                      (error "Cannot use labels as operation operands")
                      (make-primitive-exp e machine labels)))
                (operation-exp-operands exp))))
      (lambda ()
        (apply op (map (lambda (p) (p)) aprocs)))))
#+end_src
** Exercise 5.10
*Exercise*:

#+begin_quote
Design a new syntax for register-machine instructions and modify the
simulator to use your new syntax.  Can you implement your new syntax
without changing any part of the simulator except the syntax
procedures in this section?
#+end_quote

*Answer*:

- Syntax changes:
  - 1.
    #+begin_src scheme
      (assign (reg <REGISTER-NAME>) ...)
    #+end_src
    instead of
    #+begin_src scheme
      (assign <REGISTER-NAME> ...)
    #+end_src
  - 2.
    #+begin_src scheme
      (op <OPERATION-NAME> <INPUT_1> ... <INPUT_N>)
    #+end_src
    instead of
    #+begin_src scheme
      ((op <OPERATION-NAME>) <INPUT_1> ... <INPUT_N>))
    #+end_src

- Changes in the code:
  #+begin_src scheme
    ;; redefined procedures:

    (define (assign-reg-name assign-instruction)
      (cadadr assign-instruction))

    (define (operation-exp? exp)
      (and (pair? exp) (tagged-list? exp 'op)))

    (define (operation-exp-op operation-exp)
      (cadr operation-exp))

    (define (operation-exp-operands operation-exp)
      (cddr operation-exp))
  #+end_src

- Rephrasing ~the gcd-machine~ given the new syntax:
    #+begin_src scheme
      (define gcd-machine
        (make-machine
         '(a b t)
         (list (list 'rem remainder) (list '= =))
         '(test-b
           (test op = (reg b) (const 0))
           (branch (label gcd-done))
           (assign (reg t) op rem (reg a) (reg b))
           (assign (reg a) (reg b))
           (assign (reg b) (reg t))
           (goto (label test-b))
           gcd-done)))

      (set-register-contents! gcd-machine 'a 206)

      (set-register-contents! gcd-machine 'b 40)

      (start gcd-machine)

      (get-register-contents gcd-machine 'a)
    #+end_src

