blog/39.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-21 Fri 23:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 5.2.1 &#x2013; 5.2.3 A Register-Machine Simulator</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 5.2.1 &#x2013; 5.2.3 A Register-Machine Simulator
<br />
<span class="subtitle">2025-02-21 Fri</span>
</h1>
<div id="outline-container-org9cccd89" class="outline-2">
<h2 id="org9cccd89"></h2>
<div class="outline-text-2" id="text-org9cccd89">
<p>
Authors present a scheme program which simulates the kind of register
machines described in 5.1.
</p>

<p>
The highest-level abstraction is the <code>make-machine</code> procedure, which
can be used to create a machine. It takes the names of the registers,
the list of the operations the machine uses, and the controller text.
</p>

<p>
<code>Set-register-contents!</code> can be used to set the value of a register
and <code>get-register-contents</code> to retrieve it. <code>Start</code> is used to make
the machine start executing the instructions represented by the
controller text.
</p>

<p>
Authors superbly describe the implementation.
</p>
</div>
<div id="outline-container-org4265294" class="outline-3">
<h3 id="org4265294">Exercise 5.8</h3>
<div class="outline-text-3" id="text-org4265294">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The following register-machine code is ambiguous, because the label
<code>here</code> is defined more than once:
</p>

<div class="org-src-container">
<pre class="src src-scheme">start
(goto (label here))
here
(assign a (const 3))
(goto (label there))
here
(assign a (const 4))
(goto (label there))
there
</pre>
</div>

<p>
With the simulator as written, what will the contents of register <code>a</code>
be when control reaches <code>there</code>?  Modify the <code>extract-labels</code>
procedure so that the assembler will signal an error if the same label
name is used to indicate two different locations.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<blockquote>
<p>
With the simulator as written, what will the contents of register <code>a</code>
be when control reaches <code>there</code>?
</p>
</blockquote>
<p>
Labels are stored in a list in the same order they are given by the
controller text. Given the implementation of <code>lookup-label</code> &#x2014; which
uses <code>assoc</code> &#x2014;, when the same labels appears more than once, the
first one in the list will be selected. So the answer is <code>3</code>.
</p>

<blockquote>
<p>
Modify the <code>extract-labels</code> procedure so that the assembler will
signal an error if the same label name is used to indicate two
different locations.
</p>
</blockquote>

<p>
Here is a modified version of the <code>extract-labels</code> method shown in
footnote 4, page 521 (as opposed to the one in the main text).
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">extract-labels</span> text)
  (<span style="color: #531ab6;">if</span> (null? text)
      (cons '() '())
      (<span style="color: #531ab6;">let</span> ((result (extract-labels (cdr text))))
        (<span style="color: #531ab6;">let</span> ((insts (car result)) (labels (cdr result)))
          (<span style="color: #531ab6;">let</span> ((next-inst (car text)))
            (<span style="color: #531ab6;">if</span> (symbol? next-inst)
                (<span style="color: #531ab6;">if</span> (assoc next-inst labels)
                    (error <span style="color: #3548cf;">"Duplicated label:"</span> next-inst)
                    (cons insts
                          (cons (make-label-entry next-inst insts) labels)))
                (cons (cons (make-instruction next-inst) insts)
                      labels)))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0659158" class="outline-3">
<h3 id="org0659158">Exercise 5.9</h3>
<div class="outline-text-3" id="text-org0659158">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The treatment of machine operations above permits them to operate on
labels as well as on constants and the contents of registers.  Modify
the expression-processing procedures to enforce the condition that
operations can be used only with registers and constants.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-operation-exp</span> exp machine labels operations)
  (<span style="color: #531ab6;">let</span> ((op (lookup-prim (operation-exp-op exp) operations))
        (aprocs
         (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (e)
                (<span style="color: #531ab6;">if</span> (label-exp? e)
                    (error <span style="color: #3548cf;">"Cannot use labels as operation operands"</span>)
                    (make-primitive-exp e machine labels)))
              (operation-exp-operands exp))))
    (<span style="color: #531ab6;">lambda</span> ()
      (apply op (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (p) (p)) aprocs)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf308917" class="outline-3">
<h3 id="orgf308917">Exercise 5.10</h3>
<div class="outline-text-3" id="text-orgf308917">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Design a new syntax for register-machine instructions and modify the
simulator to use your new syntax.  Can you implement your new syntax
without changing any part of the simulator except the syntax
procedures in this section?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li>Syntax changes:
<ul class="org-ul">
<li><p>
1.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(assign (reg <span style="color: #005f5f;">&lt;REGISTER-NAME&gt;</span>) ...)
</pre>
</div>
<p>
instead of
</p>
<div class="org-src-container">
<pre class="src src-scheme">(assign <span style="color: #005f5f;">&lt;REGISTER-NAME&gt;</span> ...)
</pre>
</div></li>
<li><p>
2.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(op <span style="color: #005f5f;">&lt;OPERATION-NAME&gt;</span> <span style="color: #005f5f;">&lt;INPUT_1&gt;</span> ... <span style="color: #005f5f;">&lt;INPUT_N&gt;</span>)
</pre>
</div>
<p>
instead of
</p>
<div class="org-src-container">
<pre class="src src-scheme">((op <span style="color: #005f5f;">&lt;OPERATION-NAME&gt;</span>) <span style="color: #005f5f;">&lt;INPUT_1&gt;</span> ... <span style="color: #005f5f;">&lt;INPUT_N&gt;</span>))
</pre>
</div></li>
</ul></li>

<li><p>
Changes in the code:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">redefined procedures:</span>

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assign-reg-name</span> assign-instruction)
  (cadadr assign-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operation-exp?</span> exp)
  (<span style="color: #531ab6;">and</span> (pair? exp) (tagged-list? exp 'op)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operation-exp-op</span> operation-exp)
  (cadr operation-exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operation-exp-operands</span> operation-exp)
  (cddr operation-exp))
</pre>
</div></li>

<li><p>
Rephrasing <code>the gcd-machine</code> given the new syntax:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">gcd-machine</span>
  (make-machine
   '(a b t)
   (list (list 'rem remainder) (list '= =))
   '(test-b
     (test op = (reg b) (const 0))
     (branch (label gcd-done))
     (assign (reg t) op rem (reg a) (reg b))
     (assign (reg a) (reg b))
     (assign (reg b) (reg t))
     (goto (label test-b))
     gcd-done)))

(set-register-contents! gcd-machine 'a 206)

(set-register-contents! gcd-machine 'b 40)

(start gcd-machine)

(get-register-contents gcd-machine 'a)
</pre>
</div></li>
</ul>
</div>
</div>
