blog/39.org
** Exercise 5.11

*Exercise*:

#+begin_quote
When we introduced ~save~ and ~restore~ in section 5.1.4, we didn't
specify what would happen if you tried to restore a register that was
not the last one saved, as in the sequence

#+begin_src scheme
  (save y)
  (save x)
  (restore y)
#+end_src

There are several reasonable possibilities for the meaning of
`restore':

a. ~(restore y)~ puts into ~y~ the last value saved on the stack,
regardless of what register that value came from.  This is the way our
simulator behaves.  Show how to take advantage of this behavior to
eliminate one instruction from the Fibonacci machine of section 5.1.4
(see Figure 5.12).

b. ~(restore y)~ puts into ~y~ the last value saved on the stack, but
only if that value was saved from ~y~; otherwise, it signals an error.
Modify the simulator to behave this way.  You will have to change
~save~ to put the register name on the stack along with the value.

c. ~(restore y)~ puts into ~y~ the last value saved from ~y~
regardless of what other registers were saved after ~y~ and not
restored.  Modify the simulator to behave this way.  You will have to
associate a separate stack with each register.  You should make the
~initialize-stack~ operation initialize all the register stacks.
#+end_quote
*** Answer
**** a
#+begin_src scheme
  (define fib-machine
    (make-machine
     '(continue n val)
     (list (list '+ +) (list '< <) (list '- -))
     '(
       (assign continue (label fib-done))
       fib-loop
       (test (op <) (reg n) (const 2))
       (branch (label immediate-answer))
       (save continue)
       (assign continue (label afterfib-n-1))
       (save n)
       (assign n (op -) (reg n) (const 1))
       (goto (label fib-loop))
       afterfib-n-1
       (restore n)
       (restore continue)
       (assign n (op -) (reg n) (const 2))
       (save continue)
       (assign continue (label afterfib-n-2))
       (save val)
       (goto (label fib-loop))
       afterfib-n-2
       ;;(assign n (reg val)) <---------------
       ;;(restore val)        <---------------
       (restore n)        ;;  <---------------
       (restore continue)
       (assign val
               (op +) (reg val) (reg n))
       (goto (reg continue))
       immediate-answer
       (assign val (reg n))
       (goto (reg continue))
       fib-done)))
#+end_src

It works. Here is the modified machine running:

#+begin_src scheme
  repl.rkt> (define fib-machine
              (make-machine
               '(continue n val)
               (list (list '+ +) (list '< <) (list '- -))
               '(
                 (assign continue (label fib-done))
                 fib-loop
                 (test (op <) (reg n) (const 2))
                 (branch (label immediate-answer))
                 (save continue)
                 (assign continue (label afterfib-n-1))
                 (save n)
                 (assign n (op -) (reg n) (const 1))
                 (goto (label fib-loop))
                 afterfib-n-1
                 (restore n)
                 (restore continue)
                 (assign n (op -) (reg n) (const 2))
                 (save continue)
                 (assign continue (label afterfib-n-2))
                 (save val)
                 (goto (label fib-loop))
                 afterfib-n-2
                 ;;(assign n (reg val)) <---------------
                 ;;(restore val)        <---------------
                 (restore n)        ;;  <---------------
                 (restore continue)
                 (assign val
                         (op +) (reg val) (reg n))
                 (goto (reg continue))
                 immediate-answer
                 (assign val (reg n))
                 (goto (reg continue))
                 fib-done)))
  repl.rkt> (set-register-contents! fib-machine 'n 4)
  'done
  repl.rkt> (start fib-machine)
  'done
  repl.rkt> (get-register-contents fib-machine 'val)
  3
  repl.rkt> (set-register-contents! fib-machine 'n 5)
  'done
  repl.rkt> (start fib-machine)
  'done
  repl.rkt> (get-register-contents fib-machine 'val)
  5
  repl.rkt> (set-register-contents! fib-machine 'n 6)
  'done
  repl.rkt> (start fib-machine)
  'done
  repl.rkt> (get-register-contents fib-machine 'val)
  8
  repl.rkt>
#+end_src
**** b
I have:

- modified the definition of ~push~ within ~make-stack~:
  #+begin_src scheme
    (define (make-stack)
      ;;...
      (define (push x reg-name)
        (let ((obj (cons x reg-name)))
          (set! s (cons obj s))))
      ;;...
      ))
  #+end_src

- modified ~push~:
  #+begin_src scheme
    (define (push stack value reg-name)
      ((stack 'push) value reg-name))
  #+end_src

- created a couple of helper functions (one to extract the value of
  the object stored in the stack; the other to extract the name of the
  corresponding register)
  #+begin_src scheme
    (define (stack-obj-value stack-obj)
      (car stack-obj))

    (define (stack-obj-reg-name stack-obj)
      (cdr stack-obj))
  #+end_src

- modified the ~make-save~ and the ~make-restore~ procedures:

  #+begin_src scheme
    (define (make-save inst machine stack pc)
      (let ((reg-name (stack-inst-reg-name inst)))
        (let ((reg (get-register machine reg-name)))
          (lambda ()
            (push stack (get-contents reg) reg-name)
            (advance-pc pc)))))
  #+end_src

  #+begin_src scheme
    (define (make-restore inst machine stack pc)
      (let ((reg (get-register machine
                               (stack-inst-reg-name inst))))
        (lambda ()
          (let ((stack-obj (pop stack)))
            (let ((stack-val (stack-obj-value stack-obj))
                  (stack-reg-name (stack-obj-reg-name stack-obj)))
              (if (not (eq? (stack-inst-reg-name inst)
                            stack-reg-name))
                  (error "Cannot restore value in different register. Original register: ...; Attempting to save in ...")
                  (begin
                    (set-contents! reg stack-val)
                    (advance-pc pc))))))))
  #+end_src

Notice that the error is raised at simulation time.

