blog/39.html
<div id="outline-container-orgca6625b" class="outline-3">
<h3 id="orgca6625b">Exercise 5.11</h3>
<div class="outline-text-3" id="text-orgca6625b">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
When we introduced <code>save</code> and <code>restore</code> in section 5.1.4, we didn't
specify what would happen if you tried to restore a register that was
not the last one saved, as in the sequence
</p>

<div class="org-src-container">
<pre class="src src-scheme">(save y)
(save x)
(restore y)
</pre>
</div>

<p>
There are several reasonable possibilities for the meaning of
`restore':
</p>

<p>
a. <code>(restore y)</code> puts into <code>y</code> the last value saved on the stack,
regardless of what register that value came from.  This is the way our
simulator behaves.  Show how to take advantage of this behavior to
eliminate one instruction from the Fibonacci machine of section 5.1.4
(see Figure 5.12).
</p>

<p>
b. <code>(restore y)</code> puts into <code>y</code> the last value saved on the stack, but
only if that value was saved from <code>y</code>; otherwise, it signals an error.
Modify the simulator to behave this way.  You will have to change
<code>save</code> to put the register name on the stack along with the value.
</p>

<p>
c. <code>(restore y)</code> puts into <code>y</code> the last value saved from <code>y</code>
regardless of what other registers were saved after <code>y</code> and not
restored.  Modify the simulator to behave this way.  You will have to
associate a separate stack with each register.  You should make the
<code>initialize-stack</code> operation initialize all the register stacks.
</p>
</blockquote>
</div>
<div id="outline-container-orgf31c21c" class="outline-4">
<h4 id="orgf31c21c">Answer</h4>
<div class="outline-text-4" id="text-orgf31c21c">
</div>
<ul class="org-ul">
<li><a id="orgf420409"></a>a<br />
<div class="outline-text-5" id="text-orgf420409">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">fib-machine</span>
  (make-machine
   '(continue n val)
   (list (list '+ +) (list '&lt; &lt;) (list '- -))
   '(
     (assign continue (label fib-done))
     fib-loop
     (test (op &lt;) (reg n) (const 2))
     (branch (label immediate-answer))
     (save continue)
     (assign continue (label afterfib-n-1))
     (save n)
     (assign n (op -) (reg n) (const 1))
     (goto (label fib-loop))
     afterfib-n-1
     (restore n)
     (restore continue)
     (assign n (op -) (reg n) (const 2))
     (save continue)
     (assign continue (label afterfib-n-2))
     (save val)
     (goto (label fib-loop))
     afterfib-n-2
     <span style="color: #595959;">;;</span><span style="color: #595959;">(assign n (reg val)) &lt;---------------</span>
     <span style="color: #595959;">;;</span><span style="color: #595959;">(restore val)        &lt;---------------</span>
     (restore n)        <span style="color: #595959;">;;  </span><span style="color: #595959;">&lt;---------------</span>
     (restore continue)
     (assign val
             (op +) (reg val) (reg n))
     (goto (reg continue))
     immediate-answer
     (assign val (reg n))
     (goto (reg continue))
     fib-done)))
</pre>
</div>

<p>
It works. Here is the modified machine running:
</p>

<div class="org-src-container">
<pre class="src src-scheme">repl.rkt&gt; (<span style="color: #531ab6;">define</span> <span style="color: #721045;">fib-machine</span>
            (make-machine
             '(continue n val)
             (list (list '+ +) (list '&lt; &lt;) (list '- -))
             '(
               (assign continue (label fib-done))
               fib-loop
               (test (op &lt;) (reg n) (const 2))
               (branch (label immediate-answer))
               (save continue)
               (assign continue (label afterfib-n-1))
               (save n)
               (assign n (op -) (reg n) (const 1))
               (goto (label fib-loop))
               afterfib-n-1
               (restore n)
               (restore continue)
               (assign n (op -) (reg n) (const 2))
               (save continue)
               (assign continue (label afterfib-n-2))
               (save val)
               (goto (label fib-loop))
               afterfib-n-2
               <span style="color: #595959;">;;</span><span style="color: #595959;">(assign n (reg val)) &lt;---------------</span>
               <span style="color: #595959;">;;</span><span style="color: #595959;">(restore val)        &lt;---------------</span>
               (restore n)        <span style="color: #595959;">;;  </span><span style="color: #595959;">&lt;---------------</span>
               (restore continue)
               (assign val
                       (op +) (reg val) (reg n))
               (goto (reg continue))
               immediate-answer
               (assign val (reg n))
               (goto (reg continue))
               fib-done)))
repl.rkt&gt; (set-register-contents! fib-machine 'n 4)
'done
repl.rkt&gt; (start fib-machine)
'done
repl.rkt&gt; (get-register-contents fib-machine 'val)
3
repl.rkt&gt; (set-register-contents! fib-machine 'n 5)
'done
repl.rkt&gt; (start fib-machine)
'done
repl.rkt&gt; (get-register-contents fib-machine 'val)
5
repl.rkt&gt; (set-register-contents! fib-machine 'n 6)
'done
repl.rkt&gt; (start fib-machine)
'done
repl.rkt&gt; (get-register-contents fib-machine 'val)
8
repl.rkt&gt;
</pre>
</div>
</div>
</li>
<li><a id="org42a4675"></a>b<br />
<div class="outline-text-5" id="text-org42a4675">
<p>
I have:
</p>

<ul class="org-ul">
<li><p>
modified the definition of <code>push</code> within <code>make-stack</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-stack</span>)
  <span style="color: #595959;">;;</span><span style="color: #595959;">...</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push</span> x reg-name)
    (<span style="color: #531ab6;">let</span> ((obj (cons x reg-name)))
      (set! s (cons obj s))))
  <span style="color: #595959;">;;</span><span style="color: #595959;">...</span>
  ))
</pre>
</div></li>

<li><p>
modified <code>push</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push</span> stack value reg-name)
  ((stack 'push) value reg-name))
</pre>
</div></li>

<li><p>
created a couple of helper functions (one to extract the value of
the object stored in the stack; the other to extract the name of the
corresponding register)
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stack-obj-value</span> stack-obj)
  (car stack-obj))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stack-obj-reg-name</span> stack-obj)
  (cdr stack-obj))
</pre>
</div></li>

<li><p>
modified the <code>make-save</code> and the <code>make-restore</code> procedures:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-save</span> inst machine stack pc)
  (<span style="color: #531ab6;">let</span> ((reg-name (stack-inst-reg-name inst)))
    (<span style="color: #531ab6;">let</span> ((reg (get-register machine reg-name)))
      (<span style="color: #531ab6;">lambda</span> ()
        (push stack (get-contents reg) reg-name)
        (advance-pc pc)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-restore</span> inst machine stack pc)
  (<span style="color: #531ab6;">let</span> ((reg (get-register machine
                           (stack-inst-reg-name inst))))
    (<span style="color: #531ab6;">lambda</span> ()
      (<span style="color: #531ab6;">let</span> ((stack-obj (pop stack)))
        (<span style="color: #531ab6;">let</span> ((stack-val (stack-obj-value stack-obj))
              (stack-reg-name (stack-obj-reg-name stack-obj)))
          (<span style="color: #531ab6;">if</span> (not (eq? (stack-inst-reg-name inst)
                        stack-reg-name))
              (error <span style="color: #3548cf;">"Cannot restore value in different register. Original register: ...; Attempting to save in ..."</span>)
              (<span style="color: #531ab6;">begin</span>
                (set-contents! reg stack-val)
                (advance-pc pc))))))))
</pre>
</div></li>
</ul>

<p>
Notice that the error is raised at simulation time.
</p>
</div>
</li>
