blog/39.org
**** c
We can treat ~s~ as a list of stacks; each stacks being associated to
a register.

A register stack in the list can be represented as a list whose ~car~
is the name of the relevant register and whose ~cdr~ is the list of
the elements in the stack.

We can establish that if a register ~foo~ has no stack in the list,
then its stack is empty.

Given so, we can keep the ~initialize-stack~ operation as it is. By
setting the list of register stacks to an empty list, each register
will have an empty stack.

When a value ~bar~ for register ~foo~ is saved and there is no ~foo~
stack in the list of stacks, then a ~foo~ stack is created and ~bar~
saved into it.

Modified parts of the code:
#+begin_src scheme
  (define (make-stack);; actually it's a list of stacks (los) now
    (let ((s '()))
      (define (find-reg-stack los name)
        (cond ((null? los)
               '())
              ((eq? (caar los) name) ;; check tag
               (car los))
              (else
               (find-reg-stack (cdr los) name))))
      (define (push-in-los x reg-name)
        (display "push-in-los ")
        (let ((reg-stack (find-reg-stack s reg-name)))
          (if (null? reg-stack) ;; register stack not found
              ;; create reg-stack
              ;; push value
              ;; add reg-stack to los
              (let ((new-reg-stack (cons reg-name
                                         (cons x '()))))
                (set! s (cons new-reg-stack s)))
              ;; else
              ;; push-value in reg-stack
              (set-cdr! reg-stack (cons x (cdr reg-stack))))))
      (define (pop-from-los reg-name)
        (display "pop-from-los ")
        (let ((reg-stack (find-reg-stack s reg-name)))
          (if (null? reg-stack) ;; not found
              (error "Empty stack --- POP")
              (if (null? (cdr reg-stack))
                  (error "Empty stack --- POP")
                  (let ((top (car (cdr reg-stack))))
                    (set-cdr! reg-stack (cdr (cdr reg-stack)))
                    top)))))
      (define (initialize)
        (set! s '())
        'done)
      (define (dispatch message)
        (cond ((eq? message 'push) push-in-los)
              ((eq? message 'pop) pop-from-los)
              ((eq? message 'initialize) (initialize))
              (else (error "Unknown request -- STACK"
                           message))))
      dispatch))

  (define (pop stack reg-name)
    ((stack 'pop) reg-name))

  (define (push stack value reg-name)
    ((stack 'push) value reg-name))

  (define (make-save inst machine stack pc)
    (let ((reg-name (stack-inst-reg-name inst)))
      (let ((reg (get-register machine
                               reg-name)))
        (lambda ()
          (push stack (get-contents reg) reg-name)
          (advance-pc pc)))))

  (define (make-restore inst machine stack pc)
    (let ((reg-name (stack-inst-reg-name inst)))
      (let ((reg (get-register machine reg-name)))
        (lambda ()
          (set-contents! reg (pop stack reg-name))
          (advance-pc pc)))))
#+end_src
