blog/39.html
<li><a id="orga6268ab"></a>c<br />
<div class="outline-text-5" id="text-orga6268ab">
<p>
We can treat <code>s</code> as a list of stacks; each stacks being associated to
a register.
</p>

<p>
A register stack in the list can be represented as a list whose <code>car</code>
is the name of the relevant register and whose <code>cdr</code> is the list of
the elements in the stack.
</p>

<p>
We can establish that if a register <code>foo</code> has no stack in the list,
then its stack is empty.
</p>

<p>
Given so, we can keep the <code>initialize-stack</code> operation as it is. By
setting the list of register stacks to an empty list, each register
will have an empty stack.
</p>

<p>
When a value <code>bar</code> for register <code>foo</code> is saved and there is no <code>foo</code>
stack in the list of stacks, then a <code>foo</code> stack is created and <code>bar</code>
saved into it.
</p>

<p>
Modified parts of the code:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-stack</span>)<span style="color: #595959;">;; </span><span style="color: #595959;">actually it's a list of stacks (los) now</span>
  (<span style="color: #531ab6;">let</span> ((s '()))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">find-reg-stack</span> los name)
      (<span style="color: #531ab6;">cond</span> ((null? los)
             '())
            ((eq? (caar los) name) <span style="color: #595959;">;; </span><span style="color: #595959;">check tag</span>
             (car los))
            (<span style="color: #531ab6;">else</span>
             (find-reg-stack (cdr los) name))))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push-in-los</span> x reg-name)
      (display <span style="color: #3548cf;">"push-in-los "</span>)
      (<span style="color: #531ab6;">let</span> ((reg-stack (find-reg-stack s reg-name)))
        (<span style="color: #531ab6;">if</span> (null? reg-stack) <span style="color: #595959;">;; </span><span style="color: #595959;">register stack not found</span>
            <span style="color: #595959;">;; </span><span style="color: #595959;">create reg-stack</span>
            <span style="color: #595959;">;; </span><span style="color: #595959;">push value</span>
            <span style="color: #595959;">;; </span><span style="color: #595959;">add reg-stack to los</span>
            (<span style="color: #531ab6;">let</span> ((new-reg-stack (cons reg-name
                                       (cons x '()))))
              (set! s (cons new-reg-stack s)))
            <span style="color: #595959;">;; </span><span style="color: #595959;">else</span>
            <span style="color: #595959;">;; </span><span style="color: #595959;">push-value in reg-stack</span>
            (set-cdr! reg-stack (cons x (cdr reg-stack))))))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">pop-from-los</span> reg-name)
      (display <span style="color: #3548cf;">"pop-from-los "</span>)
      (<span style="color: #531ab6;">let</span> ((reg-stack (find-reg-stack s reg-name)))
        (<span style="color: #531ab6;">if</span> (null? reg-stack) <span style="color: #595959;">;; </span><span style="color: #595959;">not found</span>
            (error <span style="color: #3548cf;">"Empty stack --- POP"</span>)
            (<span style="color: #531ab6;">if</span> (null? (cdr reg-stack))
                (error <span style="color: #3548cf;">"Empty stack --- POP"</span>)
                (<span style="color: #531ab6;">let</span> ((top (car (cdr reg-stack))))
                  (set-cdr! reg-stack (cdr (cdr reg-stack)))
                  top)))))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">initialize</span>)
      (set! s '())
      'done)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
      (<span style="color: #531ab6;">cond</span> ((eq? message 'push) push-in-los)
            ((eq? message 'pop) pop-from-los)
            ((eq? message 'initialize) (initialize))
            (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- STACK"</span>
                         message))))
    dispatch))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">pop</span> stack reg-name)
  ((stack 'pop) reg-name))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push</span> stack value reg-name)
  ((stack 'push) value reg-name))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-save</span> inst machine stack pc)
  (<span style="color: #531ab6;">let</span> ((reg-name (stack-inst-reg-name inst)))
    (<span style="color: #531ab6;">let</span> ((reg (get-register machine
                             reg-name)))
      (<span style="color: #531ab6;">lambda</span> ()
        (push stack (get-contents reg) reg-name)
        (advance-pc pc)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-restore</span> inst machine stack pc)
  (<span style="color: #531ab6;">let</span> ((reg-name (stack-inst-reg-name inst)))
    (<span style="color: #531ab6;">let</span> ((reg (get-register machine reg-name)))
      (<span style="color: #531ab6;">lambda</span> ()
        (set-contents! reg (pop stack reg-name))
        (advance-pc pc)))))
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
