blog/39.org
** Exercise 5.12
*Exercise*:

#+begin_quote
The simulator can be used to help determine the data paths required
for implementing a machine with a given controller.  Extend the
assembler to store the following information in the machine model:

- a list of all instructions, with duplicates removed, sorted by
  instruction type (~assign~, ~goto~, and so on);

- a list (without duplicates) of the registers used to hold entry
  points (these are the registers referenced by ~goto~ instructions);

- a list (without duplicates) of the registers that are ~save~d or
  `restore'd;

- for each register, a list (without duplicates) of the sources from
  which it is assigned (for example, the sources for register ~val~ in
  the factorial machine of *Note Figure 5-11:: are ~(const 1)~ and ~((op
  *) (reg n) (reg val))~).

Extend the message-passing interface to the machine to provide access
to this new information.  To test your analyzer, define the Fibonacci
machine from Figure 5-12 and examine the lists you constructed.
#+end_quote

*Answer*:

I've decided to modify ~update-insts!~, since it contains a ~for-each~
which applies a ~lambda~ to each instruction. Such ~lambda~, instead
of only updating the sequence of instructions, now it extracts the
relevant information from each instruction and stores that information
in the ~reg-sources~, ~entry-point-regs~, ~sorted-instructions~, and
~saved-restored-regs~ lists. After the the lists are built, we install
the lists in the model using message-passing.

Here is the code I've modified or added:

#+begin_src racket
  (require sicp)

  ;; make copy of object
  ;;
  ;; I use to it to prevent mutations of the lists stored in the model
  (define (make-copy obj)
    (cond ((null? obj)
           '())
          ((pair? obj)
           (cons (make-copy (car obj))
                 (make-copy (cdr obj))))
          (else obj)))

  (define (make-new-machine)
    (let ((pc (make-register 'pc))
          (flag (make-register 'flag))
          (stack (make-stack))
          (the-instruction-sequence '())
          (sorted-instructions '())
          (entry-point-regs '())
          (saved-restored-regs '())
          (reg-sources '()))
      (let ((the-ops
             (list (list 'initialize-stack
                         (lambda () (stack 'initialize)))))
            (register-table
             (list (list 'pc pc) (list 'flag flag))))
        (define (allocate-register name)
          (if (assoc name register-table)
              (error "Multiply defined register: " name)
              (set! register-table
                    (cons (list name (make-register name))
                          register-table)))
          'register-allocated)
        (define (lookup-register name)
          (let ((val (assoc name register-table)))
            (if val
                (cadr val)
                (error "Unknown register:" name))))
        (define (execute)
          (let ((insts (get-contents pc)))
            (if (null? insts)
                'done
                (begin
                  ((instruction-execution-proc (car insts)))
                  (execute)))))
        (define (dispatch message)
          (cond ((eq? message 'start)
                 (set-contents! pc the-instruction-sequence)
                 (execute))
                ((eq? message 'install-instruction-sequence)
                 (lambda (seq) (set! the-instruction-sequence seq)))
                ((eq? message 'allocate-register) allocate-register)
                ((eq? message 'get-register) lookup-register)
                ((eq? message 'install-operations)
                 (lambda (ops) (set! the-ops (append the-ops ops))))
                ((eq? message 'stack) stack)
                ((eq? message 'operations) the-ops)
                ((eq? message 'sorted-instructions) (make-copy sorted-instructions))
                ((eq? message 'install-sorted-instructions)
                 (lambda (seq) (set! sorted-instructions seq)))
                ((eq? message 'entry-point-regs) (make-copy entry-point-regs))
                ((eq? message 'install-entry-point-regs)
                 (lambda (seq) (set! entry-point-regs seq)))
                ((eq? message 'saved-or-restored-regs) (make-copy saved-restored-regs))
                ((eq? message 'install-saved-or-restored-regs)
                 (lambda (seq) (set! saved-restored-regs seq)))
                ((eq? message 'reg-sources) (make-copy reg-sources))
                ((eq? message 'install-reg-sources)
                 (lambda (seq) (set! reg-sources seq)))
                (else (error "Unknown request -- MACHINE" message))))
        dispatch)))

  ;; I'm using this list to insert alphabetically in the
  ;; sorted-instructions list
  (define insts-names-in-order
    '(assign branch goto perform restore save test))

  ;; compare instructions alphabetically
  ;; return 0 if i1 = i2
  ;;        1 if i1 > i2
  ;;       -1 if i1 < i2
  (define (inst-alph-cmp i1 i2)
    (define (iter insts-names-in-order)
      (cond ((eq? i1 i2)
             0)
            ((eq? i1 (car insts-names-in-order))
             -1)
            ((eq? i2 (car insts-names-in-order))
             1)
            (else
             (iter (cdr insts-names-in-order)))))
    (iter insts-names-in-order))

  ;; return true if instruction type i1 comes alphabetically before
  ;; instruction type i2
  (define (comes-before? i1 i2)
    (= (inst-alph-cmp i1 i2) -1))

  ;; return true if instruction type i1 comes alphabetically after
  ;; instruction type i2
  (define (comes-after? i1 i2)
    (= (inst-alph-cmp i1 i2) 1))

  ;; insert inst into current list of sorted insts. In alphabetic
  ;; order. No duplicates.
  (define (insert-inst-to-sorted-insts inst-text items)
    (let ((name (car inst-text)))
      (cond ((null? items)
             (cons inst-text items))
            ((comes-before? name (caar items))
             (cons inst-text items))
            ((equal? inst-text (car items)) ;; same inst
             items)
            ((eq? name (caar items)) ;; same inst type but not same inst
             (cons (car items)
                   (insert-inst-to-sorted-insts inst-text (cdr items))))
            ((comes-after? name (caar items))
             (cons (car items)
                   (insert-inst-to-sorted-insts inst-text (cdr items)))))))

  (define (insert-no-duplicates x items)
    (cond ((null? items)
           (cons x items))
          ((eq? x (car items))
           items)
          (else
           (cons (car items)
                 (insert-no-duplicates x (cdr items))))))

  (define (update-sorted-instructions inst-text current-list)
    ;; inst is an inst obj: (text . <#proc>)
    (insert-inst-to-sorted-insts inst-text current-list))

  (define (update-entry-point-regs inst-text current-list)
    (if (and (eq? (car inst-text) 'goto)
             (eq? (caadr inst-text) 'reg))
        (let ((reg-name (cadadr inst-text)))
          (insert-no-duplicates reg-name current-list))
        current-list))

  (define (update-saved-or-restored-regs inst-text current-list)
    (if (or (eq? (car inst-text) 'save)
            (eq? (car inst-text) 'restore))
        (let ((reg-name (cadr inst-text)))
          (insert-no-duplicates reg-name current-list))
        current-list))

  (define (insert-no-equal-duplicates x items)
    (cond ((null? items)
           (cons x items))
          ((equal? x (car items))
           items)
          (else (cons (car items)
                      (insert-no-equal-duplicates x (cdr items))))))

  (define (update-reg-sources inst-text current-list)
    (if (eq? (car inst-text) 'assign)
        (insert-source inst-text current-list)
        current-list))

  (define (insert-source inst-text current-list)
    (let ((reg-name (cadr inst-text))
          (source (cddr inst-text)))
      (cond ((null? current-list)
             (list (list reg-name
                         source)))
            ((eq? (caar current-list) reg-name)
             (cons (cons reg-name
                         (insert-no-equal-duplicates
                          source
                          (cdar current-list)))
                   (cdr current-list)))
            (else ;; not the same reg
             (cons (car current-list)
                   (insert-source inst-text (cdr current-list)))))))

  (define (update-insts! insts labels machine)
    (let ((pc (get-register machine 'pc))
          (flag (get-register machine 'flag))
          (stack (machine 'stack))
          (ops (machine 'operations))
          (sorted-instructions '())
          (entry-point-regs '())
          (saved-restored-regs '())
          (reg-sources '()))
      (for-each
       (lambda (inst)
         (set-instruction-execution-proc!
          inst
          (make-execution-procedure
           (instruction-text inst) labels machine
           pc flag stack ops))
         (let ((inst-text (instruction-text inst)))
           ;; add info into the local lists
           (set! sorted-instructions
                 (update-sorted-instructions inst-text sorted-instructions))
           (set! entry-point-regs
                 (update-entry-point-regs inst-text entry-point-regs))
           (set! saved-restored-regs
                 (update-saved-or-restored-regs inst-text saved-restored-regs))
           (set! reg-sources
                 (update-reg-sources inst-text reg-sources))))
       insts)
      ;; install lists into the model
      ((machine 'install-sorted-instructions) sorted-instructions)
      ((machine 'install-entry-point-regs) entry-point-regs)
      ((machine 'install-saved-or-restored-regs) saved-restored-regs)
      ((machine 'install-reg-sources) reg-sources)))
#+end_src

These are the results using the ~fib-machine~:

#+begin_src racket
  (define fib-machine
    (make-machine
     '(continue n val)
     (list (list '+ +) (list '< <) (list '- -))
     '(
       (assign continue (label fib-done))
       fib-loop
       (test (op <) (reg n) (const 2))
       (branch (label immediate-answer))
       (save continue)
       (assign continue (label afterfib-n-1))
       (save n)
       (assign n (op -) (reg n) (const 1))
       (goto (label fib-loop))
       afterfib-n-1
       (restore n)
       (restore continue)
       (assign n (op -) (reg n) (const 2))
       (save continue)
       (assign continue (label afterfib-n-2))
       (save val)
       (goto (label fib-loop))
       afterfib-n-2
       (assign n (reg val))
       (restore val)
       (restore continue)
       (assign val
               (op +) (reg val) (reg n))
       (goto (reg continue))
       immediate-answer
       (assign val (reg n))
       (goto (reg continue))
       fib-done)))

  (set-register-contents! fib-machine 'n 4)
  (start fib-machine)
  (get-register-contents fib-machine 'val)

  (display "\nsorted instructions:\n")
  (fib-machine 'sorted-instructions)

  (display "\nentry-point-regs:\n")
  (fib-machine 'entry-point-regs)

  (display "\nsaved-or-restored-regs:\n")
  (fib-machine 'saved-or-restored-regs)

  (display "\nreg-sources:\n")
  (fib-machine 'reg-sources)
#+end_src

#+begin_src scheme
  done
  done
  3

  sorted instructions:
  ((assign continue (label fib-done))
   (assign continue (label afterfib-n-1))
   (assign n (op -) (reg n) (const 1))
   (assign n (op -) (reg n) (const 2))
   (assign continue (label afterfib-n-2))
   (assign n (reg val))
   (assign val (op +) (reg val) (reg n))
   (assign val (reg n))
   (branch (label immediate-answer))
   (goto (label fib-loop))
   (goto (reg continue))
   (restore n)
   (restore continue)
   (restore val)
   (save continue)
   (save n)
   (save val)
   (test (op <) (reg n) (const 2)))

  entry-point-regs:
  (continue)

  saved-or-restored-regs:
  (continue n val)

  reg-sources: ;; manually formatted to make structure explicit
  ((continue

    ((label fib-done))

    ((label afterfib-n-1))

    ((label afterfib-n-2)))


   (n

    ((op -) (reg n) (const 1))

    ((op -) (reg n) (const 2))

    ((reg val)))


   (val

    ((op +) (reg val) (reg n))

    ((reg n))))
#+end_src

