blog/39.html
<div id="outline-container-org44418cb" class="outline-3">
<h3 id="org44418cb">Exercise 5.12</h3>
<div class="outline-text-3" id="text-org44418cb">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The simulator can be used to help determine the data paths required
for implementing a machine with a given controller.  Extend the
assembler to store the following information in the machine model:
</p>

<ul class="org-ul">
<li>a list of all instructions, with duplicates removed, sorted by
instruction type (<code>assign</code>, <code>goto</code>, and so on);</li>

<li>a list (without duplicates) of the registers used to hold entry
points (these are the registers referenced by <code>goto</code> instructions);</li>

<li>a list (without duplicates) of the registers that are ~save~d or
`restore'd;</li>

<li>for each register, a list (without duplicates) of the sources from
which it is assigned (for example, the sources for register <code>val</code> in
the factorial machine of *Note Figure 5-11:: are <code>(const 1)</code> and <code>((op
  *) (reg n) (reg val))</code>).</li>
</ul>

<p>
Extend the message-passing interface to the machine to provide access
to this new information.  To test your analyzer, define the Fibonacci
machine from Figure 5-12 and examine the lists you constructed.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I've decided to modify <code>update-insts!</code>, since it contains a <code>for-each</code>
which applies a <code>lambda</code> to each instruction. Such <code>lambda</code>, instead
of only updating the sequence of instructions, now it extracts the
relevant information from each instruction and stores that information
in the <code>reg-sources</code>, <code>entry-point-regs</code>, <code>sorted-instructions</code>, and
<code>saved-restored-regs</code> lists. After the the lists are built, we install
the lists in the model using message-passing.
</p>

<p>
Here is the code I've modified or added:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">require</span> sicp)

<span style="color: #595959;">;; </span><span style="color: #595959;">make copy of object</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">I use to it to prevent mutations of the lists stored in the model</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-copy</span> obj)
  (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> obj)
         '())
        ((<span style="color: #8f0075;">pair?</span> obj)
         (<span style="color: #8f0075;">cons</span> (make-copy (<span style="color: #8f0075;">car</span> obj))
               (make-copy (<span style="color: #8f0075;">cdr</span> obj))))
        (<span style="color: #531ab6;">else</span> obj)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '())
        (<span style="color: #005e8b;">sorted-instructions</span> '())
        (<span style="color: #005e8b;">entry-point-regs</span> '())
        (<span style="color: #005e8b;">saved-restored-regs</span> '())
        (<span style="color: #005e8b;">reg-sources</span> '()))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'sorted-instructions</span>) (make-copy sorted-instructions))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-sorted-instructions</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> sorted-instructions seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'entry-point-regs</span>) (make-copy entry-point-regs))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-entry-point-regs</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> entry-point-regs seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'saved-or-restored-regs</span>) (make-copy saved-restored-regs))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-saved-or-restored-regs</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> saved-restored-regs seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'reg-sources</span>) (make-copy reg-sources))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-reg-sources</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> reg-sources seq)))
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))

<span style="color: #595959;">;; </span><span style="color: #595959;">I'm using this list to insert alphabetically in the</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">sorted-instructions list</span>
(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">insts-names-in-order</span>
  '(assign branch goto perform restore save test))

<span style="color: #595959;">;; </span><span style="color: #595959;">compare instructions alphabetically</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">return 0 if i1 = i2</span>
<span style="color: #595959;">;;        </span><span style="color: #595959;">1 if i1 &gt; i2</span>
<span style="color: #595959;">;;       </span><span style="color: #595959;">-1 if i1 &lt; i2</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">inst-alph-cmp</span> i1 i2)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">iter</span> insts-names-in-order)
    (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> i1 i2)
           <span style="color: #0000b0;">0</span>)
          ((<span style="color: #8f0075;">eq?</span> i1 (<span style="color: #8f0075;">car</span> insts-names-in-order))
           <span style="color: #0000b0;">-1</span>)
          ((<span style="color: #8f0075;">eq?</span> i2 (<span style="color: #8f0075;">car</span> insts-names-in-order))
           <span style="color: #0000b0;">1</span>)
          (<span style="color: #531ab6;">else</span>
           (iter (<span style="color: #8f0075;">cdr</span> insts-names-in-order)))))
  (iter insts-names-in-order))

<span style="color: #595959;">;; </span><span style="color: #595959;">return true if instruction type i1 comes alphabetically before</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">instruction type i2</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">comes-before?</span> i1 i2)
  (<span style="color: #8f0075;">=</span> (inst-alph-cmp i1 i2) <span style="color: #0000b0;">-1</span>))

<span style="color: #595959;">;; </span><span style="color: #595959;">return true if instruction type i1 comes alphabetically after</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">instruction type i2</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">comes-after?</span> i1 i2)
  (<span style="color: #8f0075;">=</span> (inst-alph-cmp i1 i2) <span style="color: #0000b0;">1</span>))

<span style="color: #595959;">;; </span><span style="color: #595959;">insert inst into current list of sorted insts. In alphabetic</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">order. No duplicates.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert-inst-to-sorted-insts</span> inst-text items)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">name</span> (<span style="color: #8f0075;">car</span> inst-text)))
    (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> items)
           (<span style="color: #8f0075;">cons</span> inst-text items))
          ((comes-before? name (<span style="color: #8f0075;">caar</span> items))
           (<span style="color: #8f0075;">cons</span> inst-text items))
          ((<span style="color: #8f0075;">equal?</span> inst-text (<span style="color: #8f0075;">car</span> items)) <span style="color: #595959;">;; </span><span style="color: #595959;">same inst</span>
           items)
          ((<span style="color: #8f0075;">eq?</span> name (<span style="color: #8f0075;">caar</span> items)) <span style="color: #595959;">;; </span><span style="color: #595959;">same inst type but not same inst</span>
           (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">car</span> items)
                 (insert-inst-to-sorted-insts inst-text (<span style="color: #8f0075;">cdr</span> items))))
          ((comes-after? name (<span style="color: #8f0075;">caar</span> items))
           (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">car</span> items)
                 (insert-inst-to-sorted-insts inst-text (<span style="color: #8f0075;">cdr</span> items)))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert-no-duplicates</span> x items)
  (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> items)
         (<span style="color: #8f0075;">cons</span> x items))
        ((<span style="color: #8f0075;">eq?</span> x (<span style="color: #8f0075;">car</span> items))
         items)
        (<span style="color: #531ab6;">else</span>
         (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">car</span> items)
               (insert-no-duplicates x (<span style="color: #8f0075;">cdr</span> items))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">update-sorted-instructions</span> inst-text current-list)
  <span style="color: #595959;">;; </span><span style="color: #595959;">inst is an inst obj: (text . &lt;#proc&gt;)</span>
  (insert-inst-to-sorted-insts inst-text current-list))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">update-entry-point-regs</span> inst-text current-list)
  (<span style="color: #531ab6;">if</span> (<span style="color: #531ab6;">and</span> (<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> inst-text) <span style="color: #0000b0;">'goto</span>)
           (<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">caadr</span> inst-text) <span style="color: #0000b0;">'reg</span>))
      (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">reg-name</span> (<span style="color: #8f0075;">cadadr</span> inst-text)))
        (insert-no-duplicates reg-name current-list))
      current-list))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">update-saved-or-restored-regs</span> inst-text current-list)
  (<span style="color: #531ab6;">if</span> (<span style="color: #531ab6;">or</span> (<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> inst-text) <span style="color: #0000b0;">'save</span>)
          (<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> inst-text) <span style="color: #0000b0;">'restore</span>))
      (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">reg-name</span> (<span style="color: #8f0075;">cadr</span> inst-text)))
        (insert-no-duplicates reg-name current-list))
      current-list))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert-no-equal-duplicates</span> x items)
  (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> items)
         (<span style="color: #8f0075;">cons</span> x items))
        ((<span style="color: #8f0075;">equal?</span> x (<span style="color: #8f0075;">car</span> items))
         items)
        (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">car</span> items)
                    (insert-no-equal-duplicates x (<span style="color: #8f0075;">cdr</span> items))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">update-reg-sources</span> inst-text current-list)
  (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> inst-text) <span style="color: #0000b0;">'assign</span>)
      (insert-source inst-text current-list)
      current-list))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert-source</span> inst-text current-list)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">reg-name</span> (<span style="color: #8f0075;">cadr</span> inst-text))
        (<span style="color: #005e8b;">source</span> (<span style="color: #8f0075;">cddr</span> inst-text)))
    (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> current-list)
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> reg-name
                       source)))
          ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">caar</span> current-list) reg-name)
           (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">cons</span> reg-name
                       (insert-no-equal-duplicates
                        source
                        (<span style="color: #8f0075;">cdar</span> current-list)))
                 (<span style="color: #8f0075;">cdr</span> current-list)))
          (<span style="color: #531ab6;">else</span> <span style="color: #595959;">;; </span><span style="color: #595959;">not the same reg</span>
           (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">car</span> current-list)
                 (insert-source inst-text (<span style="color: #8f0075;">cdr</span> current-list)))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">update-insts!</span> insts labels machine)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (get-register machine <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (get-register machine <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (machine <span style="color: #0000b0;">'stack</span>))
        (<span style="color: #005e8b;">ops</span> (machine <span style="color: #0000b0;">'operations</span>))
        (<span style="color: #005e8b;">sorted-instructions</span> '())
        (<span style="color: #005e8b;">entry-point-regs</span> '())
        (<span style="color: #005e8b;">saved-restored-regs</span> '())
        (<span style="color: #005e8b;">reg-sources</span> '()))
    (<span style="color: #8f0075;">for-each</span>
     (<span style="color: #531ab6;">lambda</span> (<span style="color: #8f0075;">inst</span>)
       (set-instruction-execution-proc!
        <span style="color: #8f0075;">inst</span>
        (make-execution-procedure
         (instruction-text <span style="color: #8f0075;">inst</span>) labels machine
         pc flag stack ops))
       (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">inst-text</span> (instruction-text <span style="color: #8f0075;">inst</span>)))
         <span style="color: #595959;">;; </span><span style="color: #595959;">add info into the local lists</span>
         (<span style="color: #531ab6;">set!</span> sorted-instructions
               (update-sorted-instructions inst-text sorted-instructions))
         (<span style="color: #531ab6;">set!</span> entry-point-regs
               (update-entry-point-regs inst-text entry-point-regs))
         (<span style="color: #531ab6;">set!</span> saved-restored-regs
               (update-saved-or-restored-regs inst-text saved-restored-regs))
         (<span style="color: #531ab6;">set!</span> reg-sources
               (update-reg-sources inst-text reg-sources))))
     insts)
    <span style="color: #595959;">;; </span><span style="color: #595959;">install lists into the model</span>
    ((machine <span style="color: #0000b0;">'install-sorted-instructions</span>) sorted-instructions)
    ((machine <span style="color: #0000b0;">'install-entry-point-regs</span>) entry-point-regs)
    ((machine <span style="color: #0000b0;">'install-saved-or-restored-regs</span>) saved-restored-regs)
    ((machine <span style="color: #0000b0;">'install-reg-sources</span>) reg-sources)))
</pre>
</div>

<p>
These are the results using the <code>fib-machine</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">fib-machine</span>
  (make-machine
   '(continue n val)
   (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'+</span> <span style="color: #8f0075;">+</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'&lt;</span> <span style="color: #8f0075;">&lt;</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'-</span> <span style="color: #8f0075;">-</span>))
   '(
     (assign continue (label fib-done))
     fib-loop
     (test (op <span style="color: #8f0075;">&lt;</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">2</span>))
     (branch (label immediate-answer))
     (save continue)
     (assign continue (label afterfib-n-1))
     (save n)
     (assign n (op <span style="color: #8f0075;">-</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">1</span>))
     (goto (label fib-loop))
     afterfib-n-1
     (restore n)
     (restore continue)
     (assign n (op <span style="color: #8f0075;">-</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">2</span>))
     (save continue)
     (assign continue (label afterfib-n-2))
     (save val)
     (goto (label fib-loop))
     afterfib-n-2
     (assign n (reg val))
     (restore val)
     (restore continue)
     (assign val
             (op <span style="color: #8f0075;">+</span>) (reg val) (reg n))
     (goto (reg continue))
     immediate-answer
     (assign val (reg n))
     (goto (reg continue))
     fib-done)))

(set-register-contents! fib-machine <span style="color: #0000b0;">'n</span> <span style="color: #0000b0;">4</span>)
(start fib-machine)
(get-register-contents fib-machine <span style="color: #0000b0;">'val</span>)

(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\nsorted instructions:\n"</span>)
(fib-machine <span style="color: #0000b0;">'sorted-instructions</span>)

(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\nentry-point-regs:\n"</span>)
(fib-machine <span style="color: #0000b0;">'entry-point-regs</span>)

(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\nsaved-or-restored-regs:\n"</span>)
(fib-machine <span style="color: #0000b0;">'saved-or-restored-regs</span>)

(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\nreg-sources:\n"</span>)
(fib-machine <span style="color: #0000b0;">'reg-sources</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">done
done
3

sorted instructions:
((assign continue (label fib-done))
 (assign continue (label afterfib-n-1))
 (assign n (op -) (reg n) (const 1))
 (assign n (op -) (reg n) (const 2))
 (assign continue (label afterfib-n-2))
 (assign n (reg val))
 (assign val (op +) (reg val) (reg n))
 (assign val (reg n))
 (branch (label immediate-answer))
 (goto (label fib-loop))
 (goto (reg continue))
 (restore n)
 (restore continue)
 (restore val)
 (save continue)
 (save n)
 (save val)
 (test (op &lt;) (reg n) (const 2)))

entry-point-regs:
(continue)

saved-or-restored-regs:
(continue n val)

reg-sources: <span style="color: #595959;">;; </span><span style="color: #595959;">manually formatted to make structure explicit</span>
((continue

  ((label fib-done))

  ((label afterfib-n-1))

  ((label afterfib-n-2)))


 (n

  ((op -) (reg n) (const 1))

  ((op -) (reg n) (const 2))

  ((reg val)))


 (val

  ((op +) (reg val) (reg n))

  ((reg n))))
</pre>
</div>
</div>
</div>
