blog/39.org
** Exercise 5.13

*Exercise*:

#+begin_quote
Modify the simulator so that it uses the controller sequence to
determine what registers the machine has rather than requiring a list
of registers as an argument to `make-machine'.  Instead of
pre-allocating the registers in `make-machine', you can allocate them
one at a time when they are first seen during assembly of the
instructions.
#+end_quote

*Answer*:

- ~Make-machine~ does not take register names anymore:
  #+begin_src racket
    (define (make-machine ops controller-text)
      (let ((machine (make-new-machine)))
        ((machine 'install-operations) ops)
        ((machine 'install-instruction-sequence)
         (assemble controller-text machine))
        machine))
  #+end_src

- I've added a ~is-reg-allocated?~ method in the machine ---
  retrievable by passing a message.

  #+begin_src racket
    (define (make-new-machine)
      (let ((pc (make-register 'pc))
            (flag (make-register 'flag))
            (stack (make-stack))
            (the-instruction-sequence '())
            (sorted-instructions '())
            (entry-point-regs '())
            (saved-restored-regs '())
            (reg-sources '()))
        (let ((the-ops
               (list (list 'initialize-stack
                           (lambda () (stack 'initialize)))))
              (register-table
               (list (list 'pc pc) (list 'flag flag))))
          (define (allocate-register name)
            (if (assoc name register-table)
                (error "Multiply defined register: " name)
                (set! register-table
                      (cons (list name (make-register name))
                            register-table)))
            'register-allocated)
          (define (is-reg-allocated? name) ;; <-------------------------------------------
            (assoc name register-table))
          (define (lookup-register name)
            (let ((val (assoc name register-table)))
              (if val
                  (cadr val)
                  (error "Unknown register:" name))))
          (define (execute)
            (let ((insts (get-contents pc)))
              (if (null? insts)
                  'done
                  (begin
                    ((instruction-execution-proc (car insts)))
                    (execute)))))
          (define (dispatch message)
            (cond ((eq? message 'start)
                   (set-contents! pc the-instruction-sequence)
                   (execute))
                  ((eq? message 'install-instruction-sequence)
                   (lambda (seq) (set! the-instruction-sequence seq)))
                  ((eq? message 'allocate-register) allocate-register)
                  ((eq? message 'is-reg-allocated?) is-reg-allocated?) ;; <---------------------
                  ((eq? message 'get-register) lookup-register)
                  ((eq? message 'install-operations)
                   (lambda (ops) (set! the-ops (append the-ops ops))))
                  ((eq? message 'stack) stack)
                  ((eq? message 'operations) the-ops)
                  ((eq? message 'sorted-instructions) (make-copy sorted-instructions))
                  ((eq? message 'install-sorted-instructions)
                   (lambda (seq) (set! sorted-instructions seq)))
                  ((eq? message 'entry-point-regs) (make-copy entry-point-regs))
                  ((eq? message 'install-entry-point-regs)
                   (lambda (seq) (set! entry-point-regs seq)))
                  ((eq? message 'saved-or-restored-regs) (make-copy saved-restored-regs))
                  ((eq? message 'install-saved-or-restored-regs)
                   (lambda (seq) (set! saved-restored-regs seq)))
                  ((eq? message 'reg-sources) (make-copy reg-sources))
                  ((eq? message 'install-reg-sources)
                   (lambda (seq) (set! reg-sources seq)))
                  (else (error "Unknown request -- MACHINE" message))))
          dispatch)))
  #+end_src

- ~Make-execution-procedure~ is now in charge of allocating the
  registers.

  #+begin_src racket
    ;; Take register name. If a register with that name hasn't been
    ;; allocated yet, then allocate it.
    (define (allocate-reg-perhaps reg-name machine)
      (or ((machine 'is-reg-allocated?) reg-name)
          ((machine 'allocate-register) reg-name)))

    ;; Take a list of expressions and a machine model. For each of the
    ;; expressions, if it is a register expression, then, if the register
    ;; of that expression has not been allocated yet, then allocate it.
    (define (allocate-list-regs-perhaps op-inputs machine)
      (cond ((null? op-inputs)
             'done)
            ((register-exp? (car op-inputs))
             (begin ;; do we need this begin?
               (allocate-reg-perhaps (register-exp-reg (car op-inputs)) machine)
               (allocate-list-regs-perhaps (cdr op-inputs) machine)))
            (else
             (allocate-list-regs-perhaps (cdr op-inputs) machine))))

    ;; Take assign instruction. Allocate those registers in it which
    ;; haven't been allocated yet.
    (define (allocate-assign-regs-perhaps inst machine)
      (allocate-reg-perhaps (assign-reg-name inst) machine)
      (cond ((register-exp? (car (assign-value-exp inst)))
             (allocate-reg-perhaps (assign-reg-name (car (assign-value-exp inst))) machine))
            ((operation-exp? (assign-value-exp inst))
             (allocate-list-regs-perhaps (operation-exp-operands (assign-value-exp inst)) machine))))

    ;; Take test instruction. Find registers in it, if any. Allocate those
    ;; which haven't been allocated yet.
    (define (allocate-test-regs-perhaps inst machine)
      (allocate-list-regs-perhaps (test-condition inst) machine))

    ;; Take save instruction. Allocate the register it refers to, if it
    ;; hasn't been allocated yet.
    (define (allocate-save-reg-perhaps inst machine)
      (allocate-reg-perhaps (cadr inst) machine))

    ;; Take restore instruction. Allocate the register it refers to, if it
    ;; hasn't been allocated yet.
    (define (allocate-restore-reg-perhaps inst machine)
      (allocate-reg-perhaps (cadr inst) machine))

    ;; Take perform instruction. Find registers in it, if any. Allocate
    ;; those which haven't been allocated yet.
    (define (allocate-perform-regs-perhaps inst machine)
      (allocate-list-regs-perhaps (perform-action inst)))

    (define (make-execution-procedure inst labels machine
                                      pc flag stack ops)
      (cond ((eq? (car inst) 'assign)
             (allocate-assign-regs-perhaps inst machine)
             (make-assign inst machine labels ops pc))
            ((eq? (car inst) 'test)
             (allocate-test-regs-perhaps inst machine)
             (make-test inst machine labels ops flag pc))
            ((eq? (car inst) 'branch)
             (make-branch inst machine labels flag pc))
            ((eq? (car inst) 'goto)
             (make-goto inst machine labels pc))
            ((eq? (car inst) 'save)
             (allocate-save-reg-perhaps inst machine)
             (make-save inst machine stack pc))
            ((eq? (car inst) 'restore)
             (allocate-restore-reg-perhaps inst machine)
             (make-restore inst machine stack pc))
            ((eq? (car inst) 'perform)
             (allocate-perform-regs-perhaps inst machine)
             (make-perform inst machine labels ops pc))
            (else (error "Unknown instruction type -- ASSEMBLE"
                         inst))))
  #+end_src

- Now a machine can be created without passing the register names. For
  example:

  #+begin_src racket
    (define fib-machine
      (make-machine
       (list (list '+ +) (list '< <) (list '- -))
       '(
         (assign continue (label fib-done))
         fib-loop
         (test (op <) (reg n) (const 2))
         (branch (label immediate-answer))
         (save continue)
         (assign continue (label afterfib-n-1))
         (save n)
         (assign n (op -) (reg n) (const 1))
         (goto (label fib-loop))
         afterfib-n-1
         (restore n)
         (restore continue)
         (assign n (op -) (reg n) (const 2))
         (save continue)
         (assign continue (label afterfib-n-2))
         (save val)
         (goto (label fib-loop))
         afterfib-n-2
         (assign n (reg val))
         (restore val)
         (restore continue)
         (assign val
                 (op +) (reg val) (reg n))
         (goto (reg continue))
         immediate-answer
         (assign val (reg n))
         (goto (reg continue))
         fib-done)))
  #+end_src
