blog/39.html
<div id="outline-container-org90201f2" class="outline-3">
<h3 id="org90201f2">Exercise 5.13</h3>
<div class="outline-text-3" id="text-org90201f2">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Modify the simulator so that it uses the controller sequence to
determine what registers the machine has rather than requiring a list
of registers as an argument to `make-machine'.  Instead of
pre-allocating the registers in `make-machine', you can allocate them
one at a time when they are first seen during assembly of the
instructions.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li><p>
<code>Make-machine</code> does not take register names anymore:
</p>
<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-machine</span> ops controller-text)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">machine</span> (make-new-machine)))
    ((machine <span style="color: #0000b0;">'install-operations</span>) ops)
    ((machine <span style="color: #0000b0;">'install-instruction-sequence</span>)
     (assemble controller-text machine))
    machine))
</pre>
</div></li>

<li><p>
I've added a <code>is-reg-allocated?</code> method in the machine &#x2014;
retrievable by passing a message.
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '())
        (<span style="color: #005e8b;">sorted-instructions</span> '())
        (<span style="color: #005e8b;">entry-point-regs</span> '())
        (<span style="color: #005e8b;">saved-restored-regs</span> '())
        (<span style="color: #005e8b;">reg-sources</span> '()))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">is-reg-allocated?</span> name) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;-------------------------------------------</span>
        (<span style="color: #8f0075;">assoc</span> name register-table))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'is-reg-allocated?</span>) is-reg-allocated?) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---------------------</span>
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'sorted-instructions</span>) (make-copy sorted-instructions))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-sorted-instructions</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> sorted-instructions seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'entry-point-regs</span>) (make-copy entry-point-regs))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-entry-point-regs</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> entry-point-regs seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'saved-or-restored-regs</span>) (make-copy saved-restored-regs))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-saved-or-restored-regs</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> saved-restored-regs seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'reg-sources</span>) (make-copy reg-sources))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-reg-sources</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> reg-sources seq)))
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))
</pre>
</div></li>

<li><p>
<code>Make-execution-procedure</code> is now in charge of allocating the
registers.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #595959;">;; </span><span style="color: #595959;">Take register name. If a register with that name hasn't been</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">allocated yet, then allocate it.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-reg-perhaps</span> reg-name machine)
  (<span style="color: #531ab6;">or</span> ((machine <span style="color: #0000b0;">'is-reg-allocated?</span>) reg-name)
      ((machine <span style="color: #0000b0;">'allocate-register</span>) reg-name)))

<span style="color: #595959;">;; </span><span style="color: #595959;">Take a list of expressions and a machine model. For each of the</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">expressions, if it is a register expression, then, if the register</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">of that expression has not been allocated yet, then allocate it.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-list-regs-perhaps</span> op-inputs machine)
  (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> op-inputs)
         <span style="color: #0000b0;">'done</span>)
        ((register-exp? (<span style="color: #8f0075;">car</span> op-inputs))
         (<span style="color: #531ab6;">begin</span> <span style="color: #595959;">;; </span><span style="color: #595959;">do we need this begin?</span>
           (allocate-reg-perhaps (register-exp-reg (<span style="color: #8f0075;">car</span> op-inputs)) machine)
           (allocate-list-regs-perhaps (<span style="color: #8f0075;">cdr</span> op-inputs) machine)))
        (<span style="color: #531ab6;">else</span>
         (allocate-list-regs-perhaps (<span style="color: #8f0075;">cdr</span> op-inputs) machine))))

<span style="color: #595959;">;; </span><span style="color: #595959;">Take assign instruction. Allocate those registers in it which</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">haven't been allocated yet.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-assign-regs-perhaps</span> <span style="color: #8f0075;">inst</span> machine)
  (allocate-reg-perhaps (assign-reg-name <span style="color: #8f0075;">inst</span>) machine)
  (<span style="color: #531ab6;">cond</span> ((register-exp? (<span style="color: #8f0075;">car</span> (assign-value-exp <span style="color: #8f0075;">inst</span>)))
         (allocate-reg-perhaps (assign-reg-name (<span style="color: #8f0075;">car</span> (assign-value-exp <span style="color: #8f0075;">inst</span>))) machine))
        ((operation-exp? (assign-value-exp <span style="color: #8f0075;">inst</span>))
         (allocate-list-regs-perhaps (operation-exp-operands (assign-value-exp <span style="color: #8f0075;">inst</span>)) machine))))

<span style="color: #595959;">;; </span><span style="color: #595959;">Take test instruction. Find registers in it, if any. Allocate those</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">which haven't been allocated yet.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-test-regs-perhaps</span> <span style="color: #8f0075;">inst</span> machine)
  (allocate-list-regs-perhaps (test-condition <span style="color: #8f0075;">inst</span>) machine))

<span style="color: #595959;">;; </span><span style="color: #595959;">Take save instruction. Allocate the register it refers to, if it</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">hasn't been allocated yet.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-save-reg-perhaps</span> <span style="color: #8f0075;">inst</span> machine)
  (allocate-reg-perhaps (<span style="color: #8f0075;">cadr</span> <span style="color: #8f0075;">inst</span>) machine))

<span style="color: #595959;">;; </span><span style="color: #595959;">Take restore instruction. Allocate the register it refers to, if it</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">hasn't been allocated yet.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-restore-reg-perhaps</span> <span style="color: #8f0075;">inst</span> machine)
  (allocate-reg-perhaps (<span style="color: #8f0075;">cadr</span> <span style="color: #8f0075;">inst</span>) machine))

<span style="color: #595959;">;; </span><span style="color: #595959;">Take perform instruction. Find registers in it, if any. Allocate</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">those which haven't been allocated yet.</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-perform-regs-perhaps</span> <span style="color: #8f0075;">inst</span> machine)
  (allocate-list-regs-perhaps (perform-action <span style="color: #8f0075;">inst</span>)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-execution-procedure</span> <span style="color: #8f0075;">inst</span> labels machine
                                  pc flag stack ops)
  (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'assign</span>)
         (allocate-assign-regs-perhaps <span style="color: #8f0075;">inst</span> machine)
         (make-assign <span style="color: #8f0075;">inst</span> machine labels ops pc))
        ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'test</span>)
         (allocate-test-regs-perhaps <span style="color: #8f0075;">inst</span> machine)
         (make-test <span style="color: #8f0075;">inst</span> machine labels ops flag pc))
        ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'branch</span>)
         (make-branch <span style="color: #8f0075;">inst</span> machine labels flag pc))
        ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'goto</span>)
         (make-goto <span style="color: #8f0075;">inst</span> machine labels pc))
        ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'save</span>)
         (allocate-save-reg-perhaps <span style="color: #8f0075;">inst</span> machine)
         (make-save <span style="color: #8f0075;">inst</span> machine stack pc))
        ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'restore</span>)
         (allocate-restore-reg-perhaps <span style="color: #8f0075;">inst</span> machine)
         (make-restore <span style="color: #8f0075;">inst</span> machine stack pc))
        ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) <span style="color: #0000b0;">'perform</span>)
         (allocate-perform-regs-perhaps <span style="color: #8f0075;">inst</span> machine)
         (make-perform <span style="color: #8f0075;">inst</span> machine labels ops pc))
        (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown instruction type -- ASSEMBLE"</span>
                     <span style="color: #8f0075;">inst</span>))))
</pre>
</div></li>

<li><p>
Now a machine can be created without passing the register names. For
example:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">fib-machine</span>
  (make-machine
   (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'+</span> <span style="color: #8f0075;">+</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'&lt;</span> <span style="color: #8f0075;">&lt;</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'-</span> <span style="color: #8f0075;">-</span>))
   '(
     (assign continue (label fib-done))
     fib-loop
     (test (op <span style="color: #8f0075;">&lt;</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">2</span>))
     (branch (label immediate-answer))
     (save continue)
     (assign continue (label afterfib-n-1))
     (save n)
     (assign n (op <span style="color: #8f0075;">-</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">1</span>))
     (goto (label fib-loop))
     afterfib-n-1
     (restore n)
     (restore continue)
     (assign n (op <span style="color: #8f0075;">-</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">2</span>))
     (save continue)
     (assign continue (label afterfib-n-2))
     (save val)
     (goto (label fib-loop))
     afterfib-n-2
     (assign n (reg val))
     (restore val)
     (restore continue)
     (assign val
             (op <span style="color: #8f0075;">+</span>) (reg val) (reg n))
     (goto (reg continue))
     immediate-answer
     (assign val (reg n))
     (goto (reg continue))
     fib-done)))
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html"></a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.93 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span></p>
</div>
</body>
</html>
